#### Jayasurya suryadatascience1921@gmail.com

## Data Cleaning Assignment

## importing Libraries

In [26]:
import numpy as np
import pandas as pd

In [27]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [28]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### 1. Some values in the the FlightNumber column are missing. These numbers aremeant to increase by 10 with each row so 10055 and 10075 need to be put inplace. Fill in these missing numbers and make the column an integer column(instead of a float column).

In [29]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

In [30]:
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

### 2. The From_To column would be better as two separate columns! Split eachstring on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporaryDataFrame.

In [31]:
df['From_To']

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [32]:
#Create a new temporary
df_temp=df.copy()

In [46]:
#split 'From_To to From,To in temporary dataframe'
df_temp[['From','To']]=df_temp.From_To.str.split('_',expand=True)

In [47]:
df_temp

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,London_paris,10045,"[23, 47]",KLM(!),London,paris
1,Madrid_milan,10055,[],<Air France> (12),Madrid,milan
2,London_stockholm,10065,"[24, 43, 87]",(British Airways. ),London,stockholm
3,Budapest_paris,10075,[13],12. Air France,Budapest,paris
4,Brussels_london,10085,"[67, 32]","""Swiss Air""",Brussels,london

### 3.Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter isuppercase (e.g. "londON" should become "London".)

In [52]:
#From_To capitalize 
df_temp['From_To'].str.capitalize()

0        London_paris
1        Madrid_milan
2    London_stockholm
3      Budapest_paris
4     Brussels_london
Name: From_To, dtype: object

In [53]:
#From capitalize
df_temp['From'].str.capitalize()

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From, dtype: object

In [54]:
#To capitalize
df_temp['To'].str.capitalize()

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

In [55]:
#Read temporary dataframe after change capitalize
df_temp

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,London_paris,10045,"[23, 47]",KLM(!),London,paris
1,Madrid_milan,10055,[],<Air France> (12),Madrid,milan
2,London_stockholm,10065,"[24, 43, 87]",(British Airways. ),London,stockholm
3,Budapest_paris,10075,[13],12. Air France,Budapest,paris
4,Brussels_london,10085,"[67, 32]","""Swiss Air""",Brussels,london

### 4.Delete the From_To column from df and attach the temporary DataFramefrom the previous questions

In [ ]:
#drop From_To columns in original dataframe
df.drop('From_To',axis=1)

In [65]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [66]:
#attach From_To column from temp dataframe into original dataframe
df['From_To']=df_temp['From_To']

In [67]:
df

   FlightNumber  RecentDelays              Airline           From_To
0         10045      [23, 47]               KLM(!)      London_paris
1         10055            []    <Air France> (12)      Madrid_milan
2         10065  [24, 43, 87]  (British Airways. )  London_stockholm
3         10075          [13]       12. Air France    Budapest_paris
4         10085      [67, 32]          "Swiss Air"   Brussels_london

### 5.In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [72]:
lists = []
r = df.apply(lambda row:[lists.append([row['Airline'], row['FlightNumber'],nn,row['From_To']])
 for nn in row.RecentDelays], axis=1)

In [73]:
lists

[['KLM(!)', 10045, 23, 'London_paris'],
 ['KLM(!)', 10045, 47, 'London_paris'],
 ['(British Airways. )', 10065, 24, 'London_stockholm'],
 ['(British Airways. )', 10065, 43, 'London_stockholm'],
 ['(British Airways. )', 10065, 87, 'London_stockholm'],
 ['12. Air France', 10075, 13, 'Budapest_paris'],
 ['"Swiss Air"', 10085, 67, 'Brussels_london'],
 ['"Swiss Air"', 10085, 32, 'Brussels_london']]

In [74]:
#create new dataframe
df_new = pd.DataFrame(lists, columns=df.columns)

In [75]:
df_new

          FlightNumber  RecentDelays  Airline           From_To
0               KLM(!)         10045       23      London_paris
1               KLM(!)         10045       47      London_paris
2  (British Airways. )         10065       24  London_stockholm
3  (British Airways. )         10065       43  London_stockholm
4  (British Airways. )         10065       87  London_stockholm
5       12. Air France         10075       13    Budapest_paris
6          "Swiss Air"         10085       67   Brussels_london
7          "Swiss Air"         10085       32   Brussels_london

In [76]:
df

   FlightNumber  RecentDelays              Airline           From_To
0         10045      [23, 47]               KLM(!)      London_paris
1         10055            []    <Air France> (12)      Madrid_milan
2         10065  [24, 43, 87]  (British Airways. )  London_stockholm
3         10075          [13]       12. Air France    Budapest_paris
4         10085      [67, 32]          "Swiss Air"   Brussels_london

### Expand the Series of lists into a DataFrame named delays, rename the columnsdelay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [77]:
#Getting the recent delay values from the data frame
df3 = pd.DataFrame(df.values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [101]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [102]:
df3.shape

(5, 3)

In [104]:
df3.rename(columns={0:'Delay1',1:'Delay2',2:'Delay3'},inplace=True)

In [105]:
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [106]:
df[["Delay1","Delay2","Delay3"]]=df3[["Delay1","Delay2","Delay3"]]

In [107]:
df

,FlightNumber,RecentDelays,Airline,From_To,Delay1,Delay2,Delay3
0,10045,"[23, 47]",KLM(!),London_paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid_milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London_stockholm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest_paris,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels_london,67.0,32.0,NaN

In [109]:
df.drop('RecentDelays',axis=1,inplace=True)

In [110]:
df

   FlightNumber              Airline           From_To  Delay1  Delay2  Delay3
0         10045               KLM(!)      London_paris    23.0    47.0     NaN
1         10055    <Air France> (12)      Madrid_milan     NaN     NaN     NaN
2         10065  (British Airways. )  London_stockholm    24.0    43.0    87.0
3         10075       12. Air France    Budapest_paris    13.0     NaN     NaN
4         10085          "Swiss Air"   Brussels_london    67.0    32.0     NaN